{
  "version": "1.14.0",
  "compound": {
    "kind": "page",
    "id": "extra_aws_certificates",
    "name": "Setting AWS Certificates",
    "url_base": "extra_aws_certificates",
    "url": "extra_aws_certificates.html",
    "include": null,
    "has_template_details": false,
    "templates": null,
    "brief": "",
    "description": "<p><a name=\"md_extras_2_a_w_s___io_t___set_certificates_2_read_me\"></a></p><p>This program loads the required certificates for communication with AWS IoT Core onto the EnviroDIY LTE Bee modem.</p><aside class=\"m-note m-danger\"><h4>Warning</h4><p>Even among modems that have SSL support, not all firmwares have support for the mutual authentication required by IOT core. You may need to update your firmware. Updating firmware requires obtaining the firmware update files - which can be difficult to find - and may require soldering to access the programming pins of your module. The firmware the EnviroDIY LTE Bee&#x27;s ship with from the factory is <em>too old</em> to work correctly with AWS&#x27;s mutual authentication! You should be running firmware version 1951B**17**SIM7080 or later. The modems provided with your Stonefly should already have been upgraded to this version.</p></aside><hr/><hr/><section id=\"read_me_advanced-work-on-aws\"><h2>Advanced Work on AWS</h2><p>Someone needs to generate the certificates and provide them to you, along with the Thing Name = Client ID = <a href=\"class_logger.html\" class=\"m-doc\">Logger</a> ID.</p></section><section id=\"read_me_customizing-the-example-sketch\"><h2>Customizing the Example Sketch</h2><p>This &quot;sketch&quot; consists of <em>TWO</em> files that you need to modify. You must edit both files and have both files in the AWS_IoT_SetCertificates folder!</p><section id=\"read_me_setup-aws-iot-config\"><h3>Setup AWS IOT Config</h3><p>This file is the configuration file which contains the actual text of the certificates. Everything in this file is unique to your logger and AWS instance. <strong>DO NOT SHARE THIS FILE!!</strong> Keep this file and the items you need below private. The certificates are like passwords allowing direct access to your AWS IoT Core instance. Protect this information like any other important password.</p><p>Before you start, have these things ready:</p><ul><li>The AWS endpoint (URL) that you will be connecting to</li><li>The thing name given to you for your own Stonefly<ul><li>These will be unique to each user</li></ul></li><li>The AWS client certificate and private key files that are linked to your thing name<ul><li>These files must be the ones corresponding to your specific thing name!</li><li>These will be unique for each user.</li><li>These files will probably be provide in a single zip file that contains your personal certificate, public key, private key, and two Amazon root CA certificates.<ul><li>Unzip the files if necessary - make sure you know where they end up on your computer after unzipping!</li></ul></li></ul></li></ul><p>Unfortunately, the Stonefly cannot read the certificates from your computer, so you need to copy and paste them here.</p><section id=\"read_me_set-your-aws-iot-core-endpoint\"><h4>Set your AWS IoT Core Endpoint</h4><p>In line 11, find and replace the text <code>YOUR_ENDPOINT-ats.iot.YOUR_REGION.amazonaws.com</code> with your real endpoint. Make sure there are quotation marks around the endpoint string, as there are in the example.</p></section><section id=\"read_me_set-your-thing-name\"><h4>Set your Thing Name</h4><p>In line 13, find and replace the text <code>YOUR_THING_NAME</code> with your assigned thing name. Make sure there are quotation marks around the name string, as there are in the example.</p></section><section id=\"read_me_set-your-aws-iot-core-client-certificate\"><h4>Set your AWS IoT Core Client Certificate</h4><p>From the required files mentioned above, find and open the file that <em>ends with</em> &quot;certificate.pem.crt&quot; in a text editor like Notepad. By default, your computer may want to open the certificate in a web browser.</p><p>On Windows:</p><ul><li>Instead of double clicking to open the file, right click and select &quot;Open with.&quot;</li><li>Find Notepad in the list of programs to open the file with.</li><li>If Notepad is not in the open list, select &quot;Choose another app&quot; and search for notepad.</li><li>You will get a security warning about opening the file - it&#x27;s a secure password file.</li><li>Open the file anyway.</li></ul><p>Once you have the file open, it should look like a bunch of random characters sandwiched between the lines <code>-----BEGIN CERTIFICATE-----</code> and <code>-----END CERTIFICATE-----</code>. Find and replace the text <code>paste the certificate here</code> in approximately line 47 of with the text of your certificate. Make sure that the text begins and ends with the lines <code>-----BEGIN CERTIFICATE-----</code> and <code>-----END CERTIFICATE-----</code> as it does in the example and in your certificate text.</p></section><section id=\"read_me_set-your-aws-iot-core-client-private-key\"><h4>Set your AWS IoT Core Client Private Key</h4><p>From the required files mentioned above, find and open the file that <em>ends with</em> &quot;private.pem.key&quot; in a text editor like Notepad. As before, you need to see the file in a text editor and you may get a security warning when you open it.</p><p>Once you have the file open, it should look like a bunch of random characters sandwiched between the lines <code>-----BEGIN RSA PRIVATE KEY-----</code> and <code>-----END RSA PRIVATE KEY-----</code>. Find and replace the text <code>paste the private key here</code> in approximately line 71 of with the text of your certificate. Make sure that the text begins and ends with the lines <code>-----BEGIN RSA PRIVATE KEY-----</code> and <code>-----END RSA PRIVATE KEY-----</code> as it does in the example and in your certificate text.</p><aside class=\"m-note m-info\"><h4>Note</h4><p>The line number where the private key starts may change based on the length of the certificate pasted above it.</p></aside></section></section><section id=\"read_me_customize-the-set-certificates-program\"><h3>Customize the Set Certificates program</h3><p>This is the program the Stonefly will run to feed the certificates onto the modem. Since all of the private information went into the config file modified above, only the cellular APN may need to be modified.</p><section id=\"read_me_select-your-modem\"><h4>Select your Modem</h4><p>In lines 27-31 remove the slashes (<code>//</code>) before the modem that you want to use and add slashes to all of the others.</p></section><section id=\"read_me_set-your-cellular-apn-or-wifi-credentials\"><h4>Set your cellular APN or Wifi credentials</h4><p>If you are using a cellular modem, in line 78, find and replace the text <code>hologram</code> with the APN for your SIM card. Make sure there are quotation marks around the APN string, as there are in the example. If you are using a Hologram SIM, you don&#x27;t need to change this.</p><p>If you are using a WiFi modem, in lines 83-84 find and replace <code>YourWiFiSSID</code> and <code>YourWiFiPassword</code> with your real SSID and password.</p></section></section></section><section id=\"read_me_upload-to-your-board\"><h2>Upload to your Board</h2><p>After correctly modifying the configuration and set certificates files, upload the sketch to your Arduino board. Instructions for uploading sketches can be found on the <a href=\"https://support.arduino.cc/hc/en-us/articles/4733418441116-Upload-a-sketch-in-Arduino-IDE\">Arduino support pages</a>.</p></section><section id=\"read_me_monitor-the-sketch-to-confirm-that-you-are-correctly-connected\"><h2>Monitor the sketch to confirm that you are correctly connected</h2><p>After uploading your program, open the serial port monitor to confirm the certificates load and you succeed in connecting to AWS IoT Core&#x27;s MQTT client. Instructions for opening the Arduino IDE&#x27;s serial monitor are on <a href=\"https://docs.arduino.cc/software/ide-v2/tutorials/ide-v2-serial-monitor/\">their support site</a>. These are the messages you should see on the serial monitor as your program runs:</p><ul><li>First there will be a several second delay and wait for the modem to wake.</li><li>After warm up, the modem will initialize and you should see the message <code>Initializing modem</code> &hellip; &hellip; <code>success</code>.</li><li>Next you will see a print out of the modem info; <code>Modem Info:</code> followed by the serial number and other info about your modem. This is just for your information.</li><li>The Stonefly will then load the CA certificate, client certificate, and key onto the modem, convert them to the modem&#x27;s internal file format, and print back the loaded text so you can confirm it matches later if there are problems.</li><li>After the certificates are loaded, the modem waits for a network connection. If the connection succeeds, you&#x27;ll see the message <code>Waiting for network</code> &hellip; &hellip; <code>success</code></li></ul><aside class=\"m-note m-danger\"><h4>Warning</h4><p>The first time you connect to the a new cellular tower with a new SIM card and new modem, the connection may take a <strong>long</strong> time - up to several minutes.</p></aside><ul><li>Now the modem waits gets a LTE internet connection. If the connection succeeds, you&#x27;ll see the message <code>Connecting to hologram</code> &hellip; <code>success</code></li><li>Once fully connected, the modem will sync its timestamp with NTP. This is required for later secured connections.</li><li>You&#x27;ll see a message <code>=== MQTT NOT CONNECTED ===</code> because you haven&#x27;t connected yet.</li><li>The modem will connect to MQTT, giving the message <code>Connecting to YOUR_ENDPOINT with client ID YOUR_THING_NAME</code> &hellip; <code>success</code></li><li>Finally, the modem will publish a message, telling you: <code>Publishing a message to YOUR_THING_NAME/init</code>.</li><li>If all is well, someone watching your AWS IoT Core&#x27;s MQTT broker will see the message {&quot;YOUR_THING_NAME&quot;:&quot;connected&quot;} from your device on the topic <code>YOUR_THING_NAME/init</code>.</li></ul></section><section id=\"read_me_troubleshooting\"><h2>Troubleshooting</h2><section id=\"read_me_compiling-or-uploading-fails\"><h3>Compiling or uploading fails</h3><p>If the program fails to compile, look at all of the places you pasted information and make sure that the strings are surrounded by quotation marks and each line ends with a semicolon. Make sure that the <code>BEGIN</code> and <code>END</code> tags are in place for each certificate. After the end of the closing tag, the next line will be a <code>)EOF</code>.</p><p>If the program fails to upload, confirm that your USB cable is tightly connected and you have the right serial port number selected. If needed, confirm that you&#x27;ve correctly set up the IDE for a your board.</p><p>If you&#x27;ve previously programmed your SAMD board (like the Stonefly) with any program (like a logging program) that might tell it to go to a low-power sleep mode, you may need to wake the board in order to program it. There are some <a href=\"https://github.com/EnviroDIY/USGS_NGWOS/?tab=readme-ov-file#reprogramming-a-sleeping-logger\">tips in the Read Me</a> for dealing with the sleeping problem.</p></section><section id=\"read_me_the-arduino-fails-to-communicate-with-the-modem\"><h3>The Arduino fails to communicate with the modem</h3><p>If you see the message <code>failed to initialize modem</code>, there&#x27;s a communication problem between the modem and the Arduino. If after the failure message and a delay you do see your modem serial number or firmware version after the message <code>Modem Info:</code>, you can ignore this error: it was a baud rate problem and the Arduino adjusted. If you don&#x27;t get the modem info, there&#x27;s something wrong. If your SIM card requires a user name and password to unlock (uncommon), enter those in lines 79 and 80 of the ino file and recompile and re-upload. Confirm that your wires between the Arduino and your modem are correct and you&#x27;ve set the correct port for <code>SerialAT</code> in line 45. Confirm that your modem has power and that any expected LED&#x27;s are lit.</p></section><section id=\"read_me_the-certificates-fail-to-load-on-the-modem\"><h3>The certificates fail to load on the modem</h3><p>If the certificates fail to load, it&#x27;s probably a pasting error. Confirm you have pasted everything correctly and each certificate begins and ends with plain text begin and end tags. If the certificates printed back to you are garbled, but you get a success message, the certificates are probably loaded correctly but the delay in going back and forth on the serial monitor caused the garbling.</p></section><section id=\"read_me_modem-fails-to-connect-to-the-network\"><h3>Modem fails to connect to the network</h3><p>Remember, this may take a <strong>long</strong> time to connect for the first time on a cellular network. Check that there is cell phone or WiFi signal in your location. If you are using a cellular connection with a Hologram SIM; they prefer to connect to T-Mobile; ask around how good the T-Mobile signal is where you are. Move somewhere else if you need to. Confirm that your SIM card is installed tightly and correctly in the modem&#x27;s SIM card slot. Also confirm that the APN is set correctly for your SIM card. Check that the wire from antenna is securely connected to the bee. Remove any wires (especially power wires) that are too close to the antenna; don&#x27;t lay the antenna on top of the USB cable from your computer to your Arduino. If you got no other error messages, but the modem won&#x27;t connect, restart and let it try again. The first connection with a new combination of SIM card, tower, and device can be painfully slow.</p></section><section id=\"read_me_modem-fails-to-get-lte-data-connection\"><h3>Modem fails to get LTE data connection</h3><p>Check your APN. It must match the APN assigned by your SIM card provider. Check your SIM username and password, if your SIM requires them (uncommon).</p></section><section id=\"read_me_ssl-client-or-mqtt-connection-fails\"><h3>SSL (Client) or MQTT connection fails</h3><p>Check your pasted certificates. Check your thing name. Cross check that the certificates are those valid for your thing name. Have someone with permissions on the AWS account check that the security policies allow your combination of certificates and thing name to make an MQTT connection. Also confirm with your AWS administrator that they have not assigned the same certificates and thing name to a second user. Two devices with the same client id may not connect at the same time. In this case, we use the thing name as the client id.</p><p>Scroll up in the serial monitor output and look for the <code>Modem Revision:</code> output. Confirm that the firmware version you have supports mutual authentication. If the firmware revision is not 1951B**17**SIM7080 or later, your modem firmware must be upgraded! Upgrading the firmware on the LTE Bee requires solder connections and special firmware files; contact Stroud for this.</p></section><section id=\"read_me_publishing-fails-or-the-message-is-not-received-by-the-broker\"><h3>Publishing fails or the message is not received by the broker</h3><p>At this time, only the AWS administrator or someone with access to the IoT Core MQTT test client will be able to confirm if the message is received, but you should see an error if the publishing fails on the device side. Have your AWS administrator confirm that your thing name and certificates give you permission to publish to the topic <code>YOUR_THING_NAME/init</code>. The <code>init</code> topic is used in this example, but not in the regular data publishing in the AWS_IoT_Core example.</p></section></section>",
    "sections": [
      [
        "read_me_advanced-work-on-aws",
        "Advanced Work on AWS",
        []
      ],
      [
        "read_me_customizing-the-example-sketch",
        "Customizing the Example Sketch",
        [
          [
            "read_me_setup-aws-iot-config",
            "Setup AWS IOT Config",
            [
              [
                "read_me_set-your-aws-iot-core-endpoint",
                "Set your AWS IoT Core Endpoint",
                []
              ],
              [
                "read_me_set-your-thing-name",
                "Set your Thing Name",
                []
              ],
              [
                "read_me_set-your-aws-iot-core-client-certificate",
                "Set your AWS IoT Core Client Certificate",
                []
              ],
              [
                "read_me_set-your-aws-iot-core-client-private-key",
                "Set your AWS IoT Core Client Private Key",
                []
              ]
            ]
          ],
          [
            "read_me_customize-the-set-certificates-program",
            "Customize the Set Certificates program",
            [
              [
                "read_me_select-your-modem",
                "Select your Modem",
                []
              ],
              [
                "read_me_set-your-cellular-apn-or-wifi-credentials",
                "Set your cellular APN or Wifi credentials",
                []
              ]
            ]
          ]
        ]
      ],
      [
        "read_me_upload-to-your-board",
        "Upload to your Board",
        []
      ],
      [
        "read_me_monitor-the-sketch-to-confirm-that-you-are-correctly-connected",
        "Monitor the sketch to confirm that you are correctly connected",
        []
      ],
      [
        "read_me_troubleshooting",
        "Troubleshooting",
        [
          [
            "read_me_compiling-or-uploading-fails",
            "Compiling or uploading fails",
            []
          ],
          [
            "read_me_the-arduino-fails-to-communicate-with-the-modem",
            "The Arduino fails to communicate with the modem",
            []
          ],
          [
            "read_me_the-certificates-fail-to-load-on-the-modem",
            "The certificates fail to load on the modem",
            []
          ],
          [
            "read_me_modem-fails-to-connect-to-the-network",
            "Modem fails to connect to the network",
            []
          ],
          [
            "read_me_modem-fails-to-get-lte-data-connection",
            "Modem fails to get LTE data connection",
            []
          ],
          [
            "read_me_ssl-client-or-mqtt-connection-fails",
            "SSL (Client) or MQTT connection fails",
            []
          ],
          [
            "read_me_publishing-fails-or-the-message-is-not-received-by-the-broker",
            "Publishing fails or the message is not received by the broker",
            []
          ]
        ]
      ]
    ],
    "deprecated": null,
    "since": null,
    "example_navigation": null,
    "footer_navigation": [
      null,
      [
        "page_extra_helper_sketches.html",
        "Extra Helper Sketches"
      ],
      null
    ],
    "topics": [],
    "dirs": [],
    "files": [],
    "namespaces": [],
    "classes": [],
    "base_classes": [],
    "derived_classes": [],
    "enums": [],
    "typedefs": [],
    "funcs": [],
    "vars": [],
    "defines": [],
    "public_types": [],
    "public_static_funcs": [],
    "typeless_funcs": [],
    "public_funcs": [],
    "signals": [],
    "public_slots": [],
    "public_static_vars": [],
    "public_vars": [],
    "protected_types": [],
    "protected_static_funcs": [],
    "protected_funcs": [],
    "protected_slots": [],
    "protected_static_vars": [],
    "protected_vars": [],
    "private_funcs": [],
    "private_slots": [],
    "related": [],
    "friend_funcs": [],
    "groups": [],
    "has_enum_details": false,
    "has_typedef_details": false,
    "has_func_details": false,
    "has_var_details": false,
    "has_define_details": false,
    "breadcrumb": [
      [
        "Extra Helper Sketches",
        "page_extra_helper_sketches.html"
      ],
      [
        "Setting AWS Certificates",
        "extra_aws_certificates.html"
      ]
    ],
    "breadcrumbGroup": [
      [
        "Setting AWS Certificates",
        "extra_aws_certificates.html"
      ]
    ]
  }
}